# Простий транслітератор української на латинецю
# На точність словника не притендую, але мені підходить
import re

class TransliterateUkr:
    def __init__(self) -> None:
        self.d = {'а':'a','б':'b','в':'v','г':'g','д':'d','е':'e',
            'ж':'zh','є':'ye','і':'i','й':'y','к':'k','л':'l','м':'m','н':'n',
            'о':'o','п':'p','р':'r','с':'s','т':'t','у':'u','ф':'f','х':'h',
            'ц':'c','ч':'ch','ш':'sh','щ':'sch','и':'u','ь':'', 'ї':'i',
            'ю':'u','я':'ya', 'А':'A','Б':'B','В':'V','Г':'G','Д':'D','Е':'E','Є':'Yе',
            'Ж':'Zh','З':'Z','И':'U','Й':'Y','К':'K','Л':'L','М':'M','Н':'N',
            'О':'O','П':'P','Р':'R','С':'S','Т':'T','У':'U','Ф':'F','Х':'H',
            'Ц':'C','Ч':'Ch','Ш':'Sh','Щ':'Sch','Ь':'',
            'Ю':'U','Я':'Ya', 'ґ':'g', 'Ґ':'G','Ї':'I'}

        self.d_spec = { '?':'','~':'','!':'','@':'','#':'',
            '$':'','%':'','^':'','&':'','*':'','(':'',')':'','-':'','=':'','+':'',
            ':':'',';':'','<':'','>':'','\'':'','"':'','\\':'','/':'','№':'',
            '[':'',']':'','{':'','}':'',
                '—':'', ' ': '_'}

    def transliteration(self, text: str, spec = False) -> str:
        ''' Проста функція транслітерації з Української на латиницю, перший арнумент 
            name - (str) це сам текст до якого потрібно застосувати транслітерацію,
            spec - (bool) Якщо вказати True то будуть прибрані деякі спеціальні символи
            '''
        text = re.sub(r'\s+', ' ', text) # чистемо зайві пробіли
        for k, v in self.d.items():
            text = text.replace(k, v)
        if spec: # Якщо потрібно прибрати деякі спеціальні символи
            for k, v in self.d_spec.items():
                text = text.replace(k, v)
        return text.strip()

if __name__ == "__main__":
    tr = TransliterateUkr()
    t = tr.transliteration('Привіт як твої справи, як їжачок, у тебе є 10 гривень?')
    print(t)
    # Print
    # > Pruvit yak tvoi spravu, yak izhachok, u tebe ye 10 gruven?
    
    t = tr.transliteration('Привіт як твої справи, як їжачок, у тебе є 10 гривень?', spec=True)
    print(t)
    # Print
    # > Pruvit_yak_tvoi_spravu,_yak_izhachok,_u_tebe_ye_10_gruven